In [1]:
%%html
<iframe src="https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html" width="800" height="600"></iframe>

In [4]:
dados = {'Nomes' : ['Rodrigo','Augusto','Fábio','Jeferson','Marcos','Matheus']}

        'Nomes' => Nome de coluna (Key/Chave)

        ['Rodrigo','Augusto','Fábio','Jeferson','Marcos','Matheus'] => dados de coluna (Values/valores)

        Rodrigo => index = 0
        Augusto => index = 1
        
        print 'Teste' Python 2.xxx
        print('Teste') Python 3.xxx
        ...

In [2]:
import pandas as pd

In [14]:
df = pd.DataFrame(data = dados)

In [17]:
display(type(df['Nomes']))

pandas.core.series.Series

In [18]:
display(type(df))

pandas.core.frame.DataFrame

In [21]:
df['Idade'] = [34,22,20,18,37,19]

In [20]:
df

      Nomes  Idade
0   Rodrigo     34
1   Augusto     22
2     Fábio     18
3  Jeferson     20
4    Marcos     37
5   Matheus     19

In [22]:
df['Cidade_Natal'] = ['Porto Alegre','Joinville','Jaraguá','Jaraguá','Joinville','Jaraguá']

In [23]:
df

      Nomes  Idade  Cidade_Natal
0   Rodrigo     34  Porto Alegre
1   Augusto     22     Joinville
2     Fábio     20       Jaraguá
3  Jeferson     18       Jaraguá
4    Marcos     37     Joinville
5   Matheus     19       Jaraguá

List Comprehenssion

lista_vazia = [ ]   

    for item in lista:
        lista_vazia.append(faça algo)

In [24]:
df['Estado'] = ['RS' if  cidade == 'Porto Alegre' else 'SC' for cidade in df['Cidade_Natal']]

In [25]:
df

      Nomes  Idade  Cidade_Natal Estado
0   Rodrigo     34  Porto Alegre     RS
1   Augusto     22     Joinville     SC
2     Fábio     20       Jaraguá     SC
3  Jeferson     18       Jaraguá     SC
4    Marcos     37     Joinville     SC
5   Matheus     19       Jaraguá     SC

In [44]:
for i in range(len(df['Cidade_Natal'])):
    print(df['Cidade_Natal'].iloc[i])

Porto Alegre
Joinville
Jaraguá
Jaraguá
Joinville
Jaraguá

In [30]:
tamanho_lista = range(len(df['Cidade_Natal']))

In [60]:
df['Altura'] = [171,1.87,1.75,1.85, None , 1.76]

In [58]:
df

      Nomes  Idade  Cidade_Natal Estado  Altura
0   Rodrigo     34  Porto Alegre     RS  171.00
1   Augusto     22     Joinville     SC    1.87
2     Fábio     20       Jaraguá     SC    1.75
3  Jeferson     18       Jaraguá     SC    1.85
4    Marcos     37     Joinville     SC     NaN
5   Matheus     19       Jaraguá     SC    1.76

In [61]:
df.fillna(value = {'Altura':1.85}, inplace=True)

In [62]:
df

      Nomes  Idade  Cidade_Natal Estado  Altura
0   Rodrigo     34  Porto Alegre     RS  171.00
1   Augusto     22     Joinville     SC    1.87
2     Fábio     20       Jaraguá     SC    1.75
3  Jeferson     18       Jaraguá     SC    1.85
4    Marcos     37     Joinville     SC    1.85
5   Matheus     19       Jaraguá     SC    1.76

In [64]:
df.replace({'Altura': 171}, 171/100, inplace=True)

In [65]:
df

      Nomes  Idade  Cidade_Natal Estado  Altura
0   Rodrigo     34  Porto Alegre     RS    1.71
1   Augusto     22     Joinville     SC    1.87
2     Fábio     20       Jaraguá     SC    1.75
3  Jeferson     18       Jaraguá     SC    1.85
4    Marcos     37     Joinville     SC    1.85
5   Matheus     19       Jaraguá     SC    1.76

## Fazer

    1 - Substituir na coluna estado:
     se SC df['Estado'] = 1 , senao df['Estado'] = 0
 
    2 - Criar uma coluna tempo de experiencia (anos) no df usado